ERDALECE/ZeyBack/Firmware/Stm32/U8G/u8g.h
extern const u8g_fntpgm_uint8_t u8g_font_lucasfont_alternate[] U8G_FONT_SECTION("u8g_font_lucasfont_alternate");
extern const u8g_fntpgm_uint8_t u8g_font_lucasfont_alternater[] U8G_FONT_SECTION("u8g_font_lucasfont_alternater");
extern const u8g_fntpgm_uint8_t u8g_font_lucasfont_alternaten[] U8G_FONT_SECTION("u8g_font_lucasfont_alternaten");

extern const u8g_fntpgm_uint8_t u8g_font_chikita[] U8G_FONT_SECTION("u8g_font_chikita");
extern const u8g_fntpgm_uint8_t u8g_font_chikitar[] U8G_FONT_SECTION("u8g_font_chikitar");
extern const u8g_fntpgm_uint8_t u8g_font_chikitan[] U8G_FONT_SECTION("u8g_font_chikitan");

extern const u8g_fntpgm_uint8_t u8g_font_pixelle_micro[] U8G_FONT_SECTION("u8g_font_pixelle_micro");
extern const u8g_fntpgm_uint8_t u8g_font_pixelle_micror[] U8G_FONT_SECTION("u8g_font_pixelle_micror");
extern const u8g_fntpgm_uint8_t u8g_font_pixelle_micron[] U8G_FONT_SECTION("u8g_font_pixelle_micron");

extern const u8g_fntpgm_uint8_t u8g_font_trixel_square[] U8G_FONT_SECTION("u8g_font_trixel_square");
extern const u8g_fntpgm_uint8_t u8g_font_trixel_squarer[] U8G_FONT_SECTION("u8g_font_trixel_squarer");
extern const u8g_fntpgm_uint8_t u8g_font_trixel_squaren[] U8G_FONT_SECTION("u8g_font_trixel_squaren");

extern const u8g_fntpgm_uint8_t u8g_font_robot_de_niro[] U8G_FONT_SECTION("u8g_font_robot_de_niro");
extern const u8g_fntpgm_uint8_t u8g_font_robot_de_niror[] U8G_FONT_SECTION("u8g_font_robot_de_niror");
extern const u8g_fntpgm_uint8_t u8g_font_robot_de_niron[] U8G_FONT_SECTION("u8g_font_robot_de_niron");

extern const u8g_fntpgm_uint8_t u8g_font_baby[] U8G_FONT_SECTION("u8g_font_baby");
extern const u8g_fntpgm_uint8_t u8g_font_babyr[] U8G_FONT_SECTION("u8g_font_babyr");
extern const u8g_fntpgm_uint8_t u8g_font_babyn[] U8G_FONT_SECTION("u8g_font_babyn");

extern const u8g_fntpgm_uint8_t u8g_font_blipfest_07[] U8G_FONT_SECTION("u8g_font_blipfest_07");
extern const u8g_fntpgm_uint8_t u8g_font_blipfest_07r[] U8G_FONT_SECTION("u8g_font_blipfest_07r");
extern const u8g_fntpgm_uint8_t u8g_font_blipfest_07n[] U8G_FONT_SECTION("u8g_font_blipfest_07n");

/* profont */

extern const u8g_fntpgm_uint8_t u8g_font_profont10[] U8G_FONT_SECTION("u8g_font_profont10");
extern const u8g_fntpgm_uint8_t u8g_font_profont10r[] U8G_FONT_SECTION("u8g_font_profont10r");
extern const u8g_fntpgm_uint8_t u8g_font_profont11[] U8G_FONT_SECTION("u8g_font_profont11");
extern const u8g_fntpgm_uint8_t u8g_font_profont11r[] U8G_FONT_SECTION("u8g_font_profont11r");
extern const u8g_fntpgm_uint8_t u8g_font_profont12[] U8G_FONT_SECTION("u8g_font_profont12");
extern const u8g_fntpgm_uint8_t u8g_font_profont12r[] U8G_FONT_SECTION("u8g_font_profont12r");
extern const u8g_fntpgm_uint8_t u8g_font_profont15[] U8G_FONT_SECTION("u8g_font_profont15");
extern const u8g_fntpgm_uint8_t u8g_font_profont15r[] U8G_FONT_SECTION("u8g_font_profont15r");
extern const u8g_fntpgm_uint8_t u8g_font_profont17[] U8G_FONT_SECTION("u8g_font_profont17");
extern const u8g_fntpgm_uint8_t u8g_font_profont17r[] U8G_FONT_SECTION("u8g_font_profont17r");
extern const u8g_fntpgm_uint8_t u8g_font_profont22[] U8G_FONT_SECTION("u8g_font_profont22");
extern const u8g_fntpgm_uint8_t u8g_font_profont22r[] U8G_FONT_SECTION("u8g_font_profont22r");
extern const u8g_fntpgm_uint8_t u8g_font_profont29[] U8G_FONT_SECTION("u8g_font_profont29");
extern const u8g_fntpgm_uint8_t u8g_font_profont29r[] U8G_FONT_SECTION("u8g_font_profont29r");
extern const u8g_fntpgm_uint8_t Head[5116] U8G_FONT_SECTION("Head");
extern const u8g_fntpgm_uint8_t Lucida[8870] U8G_FONT_SECTION("Lucida");
extern const u8g_fntpgm_uint8_t Arial22[4268] U8G_FONT_SECTION("Arial22");
extern const u8g_fntpgm_uint8_t digital22[3504] U8G_FONT_SECTION("digital22");
extern const u8g_fntpgm_uint8_t Digital12[1445] U8G_FONT_SECTION("Digital12");
extern const u8g_fntpgm_uint8_t Digital10[1350] U8G_FONT_SECTION("Digital10");

extern const u8g_fntpgm_uint8_t Azonix22[5214] U8G_FONT_SECTION("Azonix22");
extern const u8g_fntpgm_uint8_t Azonix18[4041] U8G_FONT_SECTION("Azonix18");
extern const u8g_fntpgm_uint8_t Azonix11[2134] U8G_FONT_SECTION("Azonix11");
extern const u8g_fntpgm_uint8_t Varino22[5659] U8G_FONT_SECTION("Varino22");
extern const u8g_fntpgm_uint8_t Varino12[2328] U8G_FONT_SECTION("Varino12");
extern const u8g_fntpgm_uint8_t dotdigital22[3902] U8G_FONT_SECTION("dotdigital22");
extern const u8g_fntpgm_uint8_t Sharp[3925] U8G_FONT_SECTION("Sharp");
extern const u8g_fntpgm_uint8_t Sharp16[1710]  U8G_FONT_SECTION("Sharp16");
extern const u8g_fntpgm_uint8_t Elephant[5648] U8G_FONT_SECTION("Elephant");
extern const u8g_fntpgm_uint8_t Webserver26[4176] U8G_FONT_SECTION("Webserver26");
extern const u8g_fntpgm_uint8_t United24[5572] U8G_FONT_SECTION("United24");
extern const u8g_fntpgm_uint8_t United22[4758] U8G_FONT_SECTION("United22");
extern const u8g_fntpgm_uint8_t United20[4300] U8G_FONT_SECTION("United20");
extern const u8g_fntpgm_uint8_t United12[2101] U8G_FONT_SECTION("United12");
extern const u8g_fntpgm_uint8_t United11[1977] U8G_FONT_SECTION("United11");
extern const u8g_fntpgm_uint8_t United10[1849] U8G_FONT_SECTION("United10");

extern const u8g_fntpgm_uint8_t Bloomsburg20[3101] U8G_FONT_SECTION("Bloomsburg20");


extern const u8g_fntpgm_uint8_t Phantagon48[4105] U8G_FONT_SECTION("Phantagon48");
extern const u8g_fntpgm_uint8_t Phantagon60[5180] U8G_FONT_SECTION("Phantagon60");
extern const u8g_fntpgm_uint8_t Phantagon32[2781] U8G_FONT_SECTION("Phantagon32");	
#ifdef __cplusplus
}
#endif

#endif /* _U8G_H */

